{
  "languages": {
    "en": {
      "label": "English"
    },
    "pt": {
      "label": "Portuguese"
    }
  },
  "profile": {
    "position": "Software Engineer"
  },
  "general": {
    "current": {
      "label": "Current"
    }
  },
  "components": {
    "buyMeACoffee": {
      "label": "Buy me a coffee"
    }
  },
  "pages": {
    "home": {
      "about": {
        "introduction": {
          "label": "I'm Laercio Rios"
        },
        "content": {
          "label": "Fullstack developer focused on NodeJs and React"
        },
        "description": {
          "label": "I'm a FullStack developer focused on JavaScript/TypeScript, with experience in Node.js and React.js. I have experience creating Restful APIs with clear and detailed documentation integrated with relational databases like PostgreSQL. I also have experience developing responsive interfaces and implementing efficient development and deployment pipelines (CI/CD) using Docker and GitHub Actions. In addition, I have experience creating unit and integration tests, ensuring the quality and robustness of the applications."
        }
      },
      "projects": {
        "title": {
          "label": "My Projects"
        },
        "seeMore": {
          "label": "See all projects"
        }
      },
      "experience": {
        "title": {
          "label": "Experience"
        },
        "seeMore": {
          "label": "See my full resume"
        },
        "pdfResume": {
          "label": "/cv/en.pdf"
        },
        "summary": {
          "label": "Summary"
        },
        "hasNotSummary": {
          "label": "Click on some of the experiences to see more details"
        }
      },
      "formation": {
        "title": {
          "label": "Formation"
        }
      },
      "presentations": {
        "title": {
          "label": "Presentations"
        }
      }
    },
    "projects": {
      "title": {
        "label": "FULL PORTFOLIO"
      }
    }
  },
  "data": {
    "formations": {
      "types": {
        "bachelor": {
          "label": "Bachelor"
        },
        "technician": {
          "label": "Technician"
        },
        "locked": {
          "label": "Locked"
        }
      },
      "cc": {
        "label": "Computer Science"
      },
      "ecomp": {
        "label": "Computer Engineering"
      },
      "systemDevelopment": {
        "label": "System Development"
      }
    },
    "experiences": {
      "geodatin": {
        "position": {
          "label": "Fullstack Developer"
        },
        "location": {
          "label": "Remote (Feira de Santana, Brazil)"
        },
        "description": {
          "label": "The company specializes in developing systems that integrate data intelligence and geoinformation to offer innovative solutions. My main responsibilities involve creating and maintaining Restful APIs with automated integration testing, using Node.js and TypeScript, as well as developing responsive interfaces in web applications, using React. I am also responsible for managing and optimizing databases related to PostgreSQL performing modeling and query enhancement.\n\nIn addition, we develop internal scripts and libraries focused on automating web scraping processes, prioritizing efficiency and reuse. My role also includes configuring and automating CI/CD pipelines with GitHub Actions, facilitating the flow of development and continuous deployment. Participate in meetings with clients to understand their needs and ensure that the solutions provided are aligned with their expectations."
        }
      },
      "golfarma": {
        "position": {
          "label": "Backend Developer (Intern)"
        },
        "location": {
          "label": "Hybrid (Feira de Santana, Brazil)"
        },
        "description": {
          "label": "The pharmaceutical distributor, focused on the Bahian market, began investing in technology at the end of 2019 to keep up with the transformations in the sector. During my time at the company, I worked on the development, creation, and maintenance of Restful APIs, using PHP (Laravel), ensuring the efficiency and scalability of the implemented solutions.\n\nI was also responsible for managing and maintaining databases with SQL Server and PostgreSQL, ensuring the integrity and performance of the stored information. In addition, I maintained direct contact with customers to understand their needs, solve problems, and ensure the proper implementation of the developed systems."
        }
      }
    },
    "projects": {
      "types": {
        "personal": {
          "label": "Personal"
        },
        "professional": {
          "label": "Professional"
        },
        "academic": {
          "label": "Academic"
        }
      },
      "ecope": {
        "title": {
          "label": "Ecological-Economic Platform of Pernambuco"
        },
        "description": {
          "label": "Award-winning platform from MapBiomas, the project integrates geospatial data and information about Pernambuco's environment, improving state environmental management processes, with an emphasis on environmental monitoring, licensing, and oversight. On this project, I worked on the front end, building and maintaining pages and components, as well as integrating with the API."
        }
      },
      "theLegacyOfManoel": {
        "title": {
          "label": "The Legacy of Manoel"
        },
        "description": {
          "label": "An short narrative game. The game tells the story of the first residents of the city of Pintadas in Brazil with minigame excerpts between scenes. On this project I worked alone, as a game designer and programmer, in addition to creating the art."
        }
      },
      "urlShortener": {
        "title": {
          "label": "API for URL Shortener"
        },
        "description": {
          "label": "A simple API for URL shortening. The project was developed with the aim of practicing the development of Restful APIs, using Node.js and TypeScript. The API allows URL shortening, storage in a database and redirection to the original URL."
        }
      },
      "libScrapper": {
        "title": {
          "label": "Internal Web Scraping Lib"
        },
        "description": {
          "label": "Library to automate internal web scraping processes. Obtaining data efficiently and reusably for various internal projects."
        }
      },
      "portfolioV2": {
        "title": {
          "label": "Personal Website v2"
        },
        "description": {
          "label": "The second version of my personal website. The site was developed with the purpose of showcasing my skills and experiences, as well as serving as a portfolio for my projects. I also took the opportunity to apply my design knowledge."
        }
      },
      "semesterUefs": {
        "title": {
          "label": "Semester UEFS"
        },
        "description": {
          "label": "Platform with a countdown to the end of the academic semester at University in Feira de Santana, along with a calendar featuring automatic updates to assist the academic community."
        }
      },
      "portfolioV1": {
        "title": {
          "label": "Personal Website v1"
        },
        "description": {
          "label": "First version of my personal website. It is currently outdated."
        }
      },
      "ondeAssistir": {
        "title": {
          "label": "Onde Assistir (Where to Watch)"
        },
        "description": {
          "label": "Platform that gathers information on where to watch live football matches, based on services available in Brazil. Developed as an academic project."
        }
      },
      "ppbio": {
        "title": {
          "label": "PPBio"
        },
        "description": {
          "label": "Platform featuring a listing of projects for fundraising, focused on the Legal Amazon region. I contributed by developing the API."
        }
      },
      "rhisa": {
        "title": {
          "label": "Rhisa"
        },
        "description": {
          "label": "Platform focused on creating a network of researchers working in the Legal Amazon region. I contributed to the development of the API and data scraping."
        }
      },
      "leadbase": {
        "title": {
          "label": "Leadbase"
        },
        "description": {
          "label": "Data management platform for pharmacies."
        }
      }
    },
    "presentations": {
      "masterChefEcomp": {
        "title": {
          "label": "MasterChef ECOMP: The Recipe for Writing Good Code"
        },
        "event": {
          "label": "XXX SIECOMP"
        },
        "description": {
          "label": "The talk addressed the importance of learning the programming basics and making a correlation with cooking. The idea was to show that, just as in cooking, it is necessary to understand the ingredients and their functions to create an elaborate cake, in programming it is necessary to understand the concepts and their applications to create efficient and quality code."
        }
      }
    }
  }
}