{
  "languages": {
    "en": {
      "label": "Inglês"
    },
    "pt": {
      "label": "Português"
    }
  },
  "profile": {
    "position": "Desenvolvedor de Software"
  },
  "general": {
    "current": {
      "label": "Atual"
    }
  },
  "components": {
    "buyMeACoffee": {
      "label": "Buy me a coffee"
    }
  },
  "pages": {
    "home": {
      "about": {
        "introduction": {
          "label": "Eu sou Laercio Rios"
        },
        "content": {
          "label": "Programador fullstack com foco NodeJs e React"
        },
        "description": {
          "label": "Sou desenvolvedor FullStack focado em JavaScript/TypeScript, com experiência em Node.js e React.js.Tenho experiência na criação de APIs Restful com documentações claras e detalhadas, integradas a bancos de dados relacionais como PostgreSQL. Também possuo experiência no desenvolvimento de interfaces responsivas e na implementação de pipelines de desenvolvimento e deploy eficientes (CI/CD), utilizando Docker e GitHub Actions. Além disso, possuo experiência na criação de testes unitários e de integração, garantindo a qualidade e a robustez das aplicações."
        }
      },
      "projects": {
        "title": {
          "label": "Meus Projetos"
        },
        "seeMore": {
          "label": "Veja todos os projetos"
        }
      },
      "experience": {
        "title": {
          "label": "Experiência"
        },
        "seeMore": {
          "label": "Veja meu currículo completo"
        },
        "pdfResume": {
          "label": "/cv/pt.pdf"
        },
        "summary": {
          "label": "Resumo"
        },
        "hasNotSummary": {
          "label": "Clique em algumas das experiências para ver mais detalhes"
        }
      },
      "formation": {
        "title": {
          "label": "Formação"
        }
      },
      "presentations": {
        "title": {
          "label": "Apresentações"
        }
      }
    },
    "projects": {
      "title": {
        "label": "PORTFÓLIO COMPLETO"
      }
    }
  },
  "data": {
    "formations": {
      "types": {
        "bachelor": {
          "label": "Bacharelado"
        },
        "technician": {
          "label": "Técnico"
        },
        "locked": {
          "label": "Trancado"
        }
      },
      "cc": {
        "label": "Ciência da Computação"
      },
      "ecomp": {
        "label": "Engenharia de Computação"
      },
      "systemDevelopment": {
        "label": "Desenvolvimento de Sistemas"
      }
    },
    "experiences": {
      "geodatin": {
        "position": {
          "label": "Desenvolvedor Fullstack"
        },
        "location": {
          "label": "Remoto (Feira de Santana - BA)"
        },
        "description": {
          "label": "A empresa é especializada no desenvolvimento de sistemas que integram inteligência de dados e geoinformação para oferecer soluções inovadoras. Minhas principais responsabilidades envolvem a criação e manutenção de APIs Restful com testes de integração automatizados, utilizando Node.js e TypeScript, além do desenvolvimento de interfaces responsivas em aplicações web, usando React. Também sou responsável pelo gerenciamento e otimização de bancos de dados relacionais com PostgreSQL, realizando modelagem e aprimoramento de consultas.\n\nAlém disso, desenvolvo scripts e bibliotecas internas focados na automação de processos de web scraping, priorizando a eficiência e reutilização. Minha atuação inclui ainda a configuração e automação de pipelines de CI/CD com GitHub Actions, facilitando o fluxo de desenvolvimento e deploy contínuo. Participo ativamente de reuniões com clientes para entender suas necessidades e assegurar que as soluções desenvolvidas estejam alinhadas com suas expectativas."
        }
      },
      "golfarma": {
        "position": {
          "label": "Desenvolvedor Backend (Estágio)"
        },
        "location": {
          "label": "Híbrido (Feira de Santana - BA)"
        },
        "description": {
          "label": "A distribuidora farmacêutica, com foco no mercado baiano, começou a investir em tecnologia no final de 2019 para acompanhar as transformações do setor. Durante meu período na empresa, atuei no desenvolvimento, criação e manutenção de APIs Restful, utilizando PHP (Laravel), garantindo a eficiência e escalabilidade das soluções implementadas.\n\nTambém fui responsável pelo gerenciamento e manutenção de bancos de dados com SQL Server e PostgreSQL, assegurando a integridade e a performance das informações armazenadas. Além disso, mantive contato direto com clientes para entender suas necessidades, solucionar problemas e garantir a implementação adequada dos sistemas desenvolvidos."
        }
      }
    },
    "projects": {
      "types": {
        "personal": {
          "label": "Pessoal"
        },
        "professional": {
          "label": "Profissional"
        },
        "academic": {
          "label": "Acadêmico"
        }
      },
      "ecope": {
        "title": {
          "label": "Plataforma Ecológico-Econômica de Pernambuco"
        },
        "description": {
          "label": "Plataforma premiada pelo MapBiomas, o projeto integra dados e informações geoespaciais do meio ambiente pernambucano, qualificando os processos de gestão ambiental estadual, com ênfase no monitoramento, licenciamento e fiscalização Ambiental. Neste projeto trabalhei atuando no front-end construindo e mantendo páginas e componentes, além de realizar a integração com a API."
        }
      },
      "theLegacyOfManoel": {
        "title": {
          "label": "O Legado de Manoel"
        },
        "description": {
          "label": "Um jogo narrativo curto. O jogo conta a história sobre os primeiros moradores da cidade de Pintadas no Brasil com trechos de minigames entre as cenas. Neste projeto eu trabalhei sozinho, como game designer e programador, além de criar as artes."
        }
      },
      "urlShortener": {
        "title": {
          "label": "API para Encurtador de URL"
        },
        "description": {
          "label": "Uma API simples para encurtamento de URLs. O projeto foi desenvolvido com o intuito de praticar o desenvolvimento de APIs Restful, utilizando Node.js e TypeScript. A API permite o encurtamento de URLs, armazenamento em banco de dados e redirecionamento para a URL original."
        }
      },
      "libScrapper": {
        "title": {
          "label": "Biblioteca de Web Scraping Interno"
        },
        "description": {
          "label": "Biblioteca para automatizar processos de web scraping interno. Obtendo dados de forma eficiente e reutilizável para diversos projetos internos."
        }
      },
      "portfolioV2": {
        "title": {
          "label": "Site Pessoal v2"
        },
        "description": {
          "label": "Segunda versão do meu site pessoal. O site foi desenvolvido com o intuito de apresentar minhas habilidades e experiências, além de servir como um portfólio para meus projetos. Também aproveitei para aplicar meus conhecimentos de design."
        }
      },
      "semesterUefs": {
        "title": {
          "label": "Semestre UEFS"
        },
        "description": {
          "label": "Plataforma com contagem dos dias para o fim do semestre letivo da Universidade Estadual de Feira de Santana, além de um calendário com atualizações automáticas para ajudar a comunidade acadêmica."
        }
      },
      "portfolioV1": {
        "title": {
          "label": "Site Pessoal v1"
        },
        "description": {
          "label": "Primeira versão do meu site pessoal. Atualmente ele está desatualizado."
        }
      },
      "ondeAssistir": {
        "title": {
          "label": "Onde Assistir"
        },
        "description": {
          "label": "Plataforma que reúne informações sobre onde assistir partidas de futebol ao vivo, com base em serviços disponíveis no Brasil. Desenvolvimento como projeto acadêmico."
        }
      },
      "ppbio": {
        "title": {
          "label": "Programa Prioritário de Bioeconomia (PPBio)"
        },
        "description": {
          "label": "Plataforma com listagem de projetos para capitação de recursos, focado na Amazônia Legal. Atuei desenvolvendo a API."
        }
      },
      "rhisa": {
        "title": {
          "label": "Rhisa"
        },
        "description": {
          "label": "Plataforma focado na criação de uma rede de pesquisadores atuando na Amazônia Legal. Atuei no desenvolvimento da API e no scraping dos dados."
        }
      },
      "leadbase": {
        "title": {
          "label": "Leadbase"
        },
        "description": {
          "label": "Plataforma de gestão de dados para farmácias."
        }
      }
    },
    "presentations": {
      "masterChefEcomp": {
        "title": {
          "label": "MasterChef ECOMP: A Receita para Fazer um Bom Código"
        },
        "event": {
          "label": "XXX SIECOMP"
        },
        "description": {
          "label": "A palestra abordou a importância de aprender as bases programação, fazendo uma correlação com a culinária. A ideia foi mostrar que, assim como na culinária, é necessário entender os ingredientes e suas funções para criar um bolo elaborado, na programação é necessário entender os conceitos e suas aplicações para criar um código eficiente e de qualidade."
        }
      }
    }
  }
}